app/controllers/facilities_controller.rb

  def index
    @facilities = Facility.all
    @hospitals = Hospital.all #Is there a better way? Should I do this?
---
SELECT * FROM `facilities`
SELECT * FROM `hospitals`