app/controllers/facility_types_controller.rb

  def index
    @facility_types = FacilityType.all
---
SELECT * FROM `facility_types`