app/controllers/hospitals_controller.rb

  def index
    @hospitals = Hospital.all
---
SELECT * FROM `hospitals`

  def show
    @hospital = Hospital.find(params[:id])
---
SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 953125641)

  def edit
    @hospital = Hospital.find(params[:id])
---
SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 953125641)

  def create
    @hospital = Hospital.new(params[:hospital])

    respond_to do |format|
      if @hospital.save
---
INSERT INTO `hospitals` (`maps_longitude`, `updated_at`, `region`, `url`, `short_name`, `phone`, `fax`, `note`, `full_name`, `address`, `maps_latitude`, `image`, `email`, `created_at`) VALUES(NULL, '2009-05-25 21:01:42', NULL, 'http://www.nmh.ie/', 'NMH', '016373550', 'test', 'This is a test', 'National Maternity Hospital', 'This is a test', NULL, 'test.jpg', 'info@nmh.ie', '2009-05-25 21:01:42')

  def update
    @hospital = Hospital.find(params[:id])

    respond_to do |format|
      if @hospital.update_attributes(params[:hospital])
---
SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 953125641)
UPDATE `hospitals` SET `phone` = 'Test Phone Update', `address` = 'Test Address Update', `image` = x'546573745570646174652e6a7067', `full_name` = 'Test Full Name Update', `short_name` = '', `email` = 'test@test.com', `updated_at` = '2009-04-25 17:39:17' WHERE `id` = 953125641

  def destroy
    @hospital = Hospital.find(params[:id])
    @hospital.destroy
---
SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 953125641)
DELETE FROM `hospitals` WHERE `id` = 953125641